benchmark/tmp/poc_jmeter_2.yml
# services: 
# - module: 
#     post-process: 
#       - cat /benchmark/tmp/bzt.log

execution:
- concurrency: 1
  # ramp-up: 1m
  hold-for: 1m
  scenario: simple

#part of poc
# scenarios:
#   simple:
#     think-time: 0.75
#     requests:
#     - http://blazedemo.com/

scenarios:
  simple:
    script: benchmark/scripts/poc_jmeter_2.jmx

modules:
  jmeter:
    path: benchmark/jmeter/apache-jmeter-5.0/bin/jmeter
    download-link: https://archive.apache.org/dist/jmeter/binaries/apache-jmeter-5.0.zip
    version: 5.0 
    force-ctg: true 
    detect-plugins: false

  console: 
    disable: true 

settings: 
  artifacts-dir: benchmark/tmp
  
reporting:
- module: final_stats
  summary: true 
  percentiles: false  
  summary-labels: false 
  failed-labels: false  
  test-duration: true 

  # SLA: 200ms = 0.2s 
    # Pass: <= 200ms 
    # Fail > 200ms 

- module: passfail
  criteria:
    Passed Transactions: avg-rt of health_check <=300ms, continue as non-failed
    Failed transactions: avg-rt of health_check >300ms, stop as failed